{"config": [{"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 200, 200, 3], "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "name": "conv2d_13", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "padding": "same", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_13", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_14", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 64, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_14", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_15", "strides": [1, 1], "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "filters": 128, "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_15", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_5"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 128, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "seed": null, "distribution": "uniform", "mode": "fan_in"}, "class_name": "VarianceScaling"}, "name": "dense_9", "kernel_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 1, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_10", "kernel_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}